experiments/2026-08-18-qwen-qwen3-8b-v1-5fa1f7e/vllm__ragged-sla.log
INFO 08-18 17:08:40 [importing.py:53] Triton is installed but 0 active driver(s) found (expected 1). Disabling Triton to prevent runtime errors.
INFO 08-18 17:08:40 [importing.py:88] Triton not installed or not compatible; certain GPU-related functions will not be available.
INFO 08-18 17:08:42 [main.py:71] Unspecified platform detected, switching to CPU Platform instead.
WARNING 08-18 17:08:42 [cpu.py:440] Failed to import from vllm._C: ModuleNotFoundError("No module named 'vllm._C'")
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x75b3dd500860>, trust_remote_code=False, seed=0, num_prompts=100, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=512, random_output_len=512, random_range_ratio='0.75', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url='http://vllm:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=None, model='Qwen/Qwen3-8B', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=4.0, burstiness=1.0, probe_request_rate=0.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/results', result_filename='vllm__ragged-sla.json', ignore_eos=False, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='99', goodput=['ttft:2000', 'tpot:50'], request_id_prefix='bench-9de29e06-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 08-18 17:08:45 [utils.py:90] Sampling input_len from [128, 896] and output_len from [128, 896]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 4.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     100       
Failed requests:                         0         
Request rate configured (RPS):           4.00      
Benchmark duration (s):                  88.00     
Total input tokens:                      51917     
Total generated tokens:                  55471     
Request throughput (req/s):              1.14      
Request goodput (req/s):                 0.15      
Output token throughput (tok/s):         630.32    
Peak output token throughput (tok/s):    712.00    
Peak concurrent requests:                75.00     
Total token throughput (tok/s):          1220.26   
---------------Time to First Token----------------
Mean TTFT (ms):                          23693.21  
Median TTFT (ms):                        23166.92  
P99 TTFT (ms):                           53088.64  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          11.77     
Median TPOT (ms):                        11.79     
P99 TPOT (ms):                           12.17     
---------------Inter-token Latency----------------
Mean ITL (ms):                           11.77     
Median ITL (ms):                         11.45     
P99 ITL (ms):                            27.37     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          30213.07  
Median E2EL (ms):                        29532.93  
P99 E2EL (ms):                           61860.29  
==================================================

--- stderr ---
W0818 17:08:41.292000 1 torch/utils/cpp_extension.py:178] No CUDA runtime is found, using CUDA_HOME='/usr/local/cuda'
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.

  0%|          | 0/100 [00:00<?, ?it/s]
  1%|          | 1/100 [00:03<06:12,  3.76s/it]
  2%|▏         | 2/100 [00:04<02:57,  1.81s/it]
  3%|▎         | 3/100 [00:04<01:55,  1.19s/it]
  4%|▍         | 4/100 [00:05<01:28,  1.09it/s]
  5%|▌         | 5/100 [00:05<01:03,  1.50it/s]
  6%|▌         | 6/100 [00:08<02:05,  1.34s/it]
  7%|▋         | 7/100 [00:08<01:47,  1.16s/it]
  8%|▊         | 8/100 [00:09<01:24,  1.08it/s]
  9%|▉         | 9/100 [00:09<01:16,  1.19it/s]
 10%|█         | 10/100 [00:10<01:21,  1.11it/s]
 11%|█         | 11/100 [00:11<01:09,  1.27it/s]
 13%|█▎        | 13/100 [00:13<01:17,  1.12it/s]
 14%|█▍        | 14/100 [00:13<01:03,  1.35it/s]
 15%|█▌        | 15/100 [00:14<01:04,  1.32it/s]
 16%|█▌        | 16/100 [00:14<00:51,  1.64it/s]
 17%|█▋        | 17/100 [00:17<01:46,  1.28s/it]
 18%|█▊        | 18/100 [00:18<01:20,  1.02it/s]
 20%|██        | 20/100 [00:18<00:53,  1.50it/s]
 21%|██        | 21/100 [00:18<00:47,  1.67it/s]
 22%|██▏       | 22/100 [00:20<00:55,  1.40it/s]
 23%|██▎       | 23/100 [00:20<00:45,  1.70it/s]
 24%|██▍       | 24/100 [00:20<00:37,  2.05it/s]
 25%|██▌       | 25/100 [00:24<01:45,  1.40s/it]
 26%|██▌       | 26/100 [00:25<01:33,  1.27s/it]
 27%|██▋       | 27/100 [00:25<01:09,  1.06it/s]
 29%|██▉       | 29/100 [00:27<01:19,  1.12s/it]
 31%|███       | 31/100 [00:28<00:53,  1.28it/s]
 32%|███▏      | 32/100 [00:28<00:44,  1.55it/s]
 33%|███▎      | 33/100 [00:29<00:52,  1.27it/s]
 35%|███▌      | 35/100 [00:31<00:46,  1.41it/s]
 36%|███▌      | 36/100 [00:32<00:58,  1.09it/s]
 37%|███▋      | 37/100 [00:33<00:56,  1.11it/s]
 38%|███▊      | 38/100 [00:33<00:43,  1.43it/s]
 39%|███▉      | 39/100 [00:35<00:57,  1.06it/s]
 40%|████      | 40/100 [00:35<00:47,  1.28it/s]
 41%|████      | 41/100 [00:35<00:37,  1.55it/s]
 42%|████▏     | 42/100 [00:36<00:44,  1.31it/s]
 43%|████▎     | 43/100 [00:38<00:59,  1.05s/it]
 44%|████▍     | 44/100 [00:39<00:48,  1.15it/s]
 46%|████▌     | 46/100 [00:39<00:29,  1.86it/s]
 47%|████▋     | 47/100 [00:40<00:38,  1.38it/s]
 48%|████▊     | 48/100 [00:41<00:33,  1.57it/s]
 49%|████▉     | 49/100 [00:42<00:44,  1.14it/s]
 50%|█████     | 50/100 [00:43<00:37,  1.32it/s]
 51%|█████     | 51/100 [00:44<00:47,  1.03it/s]
 52%|█████▏    | 52/100 [00:45<00:45,  1.05it/s]
 53%|█████▎    | 53/100 [00:45<00:37,  1.25it/s]
 54%|█████▍    | 54/100 [00:46<00:31,  1.44it/s]
 55%|█████▌    | 55/100 [00:46<00:26,  1.67it/s]
 56%|█████▌    | 56/100 [00:49<00:53,  1.23s/it]
 57%|█████▋    | 57/100 [00:49<00:41,  1.04it/s]
 58%|█████▊    | 58/100 [00:51<00:47,  1.13s/it]
 59%|█████▉    | 59/100 [00:51<00:39,  1.05it/s]
 60%|██████    | 60/100 [00:52<00:28,  1.40it/s]
 61%|██████    | 61/100 [00:53<00:35,  1.08it/s]
 62%|██████▏   | 62/100 [00:54<00:41,  1.08s/it]
 63%|██████▎   | 63/100 [00:55<00:31,  1.17it/s]
 65%|██████▌   | 65/100 [00:55<00:19,  1.83it/s]
 67%|██████▋   | 67/100 [00:55<00:12,  2.74it/s]
 68%|██████▊   | 68/100 [00:57<00:23,  1.37it/s]
 69%|██████▉   | 69/100 [00:59<00:28,  1.08it/s]
 70%|███████   | 70/100 [01:00<00:27,  1.09it/s]
 71%|███████   | 71/100 [01:00<00:23,  1.21it/s]
 72%|███████▏  | 72/100 [01:02<00:30,  1.08s/it]
 73%|███████▎  | 73/100 [01:02<00:23,  1.17it/s]
 74%|███████▍  | 74/100 [01:03<00:21,  1.24it/s]
 76%|███████▌  | 76/100 [01:03<00:11,  2.04it/s]
 77%|███████▋  | 77/100 [01:04<00:10,  2.24it/s]
 78%|███████▊  | 78/100 [01:05<00:16,  1.30it/s]
 79%|███████▉  | 79/100 [01:07<00:21,  1.00s/it]
 80%|████████  | 80/100 [01:07<00:17,  1.16it/s]
 81%|████████  | 81/100 [01:09<00:22,  1.21s/it]
 82%|████████▏ | 82/100 [01:10<00:19,  1.09s/it]
 83%|████████▎ | 83/100 [01:11<00:15,  1.12it/s]
 84%|████████▍ | 84/100 [01:12<00:15,  1.05it/s]
 85%|████████▌ | 85/100 [01:13<00:14,  1.04it/s]
 86%|████████▌ | 86/100 [01:13<00:10,  1.33it/s]
 88%|████████▊ | 88/100 [01:14<00:06,  1.83it/s]
 89%|████████▉ | 89/100 [01:16<00:10,  1.03it/s]
 90%|█████████ | 90/100 [01:17<00:09,  1.06it/s]
 91%|█████████ | 91/100 [01:18<00:08,  1.11it/s]
 92%|█████████▏| 92/100 [01:19<00:08,  1.11s/it]
 93%|█████████▎| 93/100 [01:20<00:06,  1.06it/s]
 94%|█████████▍| 94/100 [01:21<00:05,  1.06it/s]
 96%|█████████▌| 96/100 [01:22<00:03,  1.26it/s]
 97%|█████████▋| 97/100 [01:22<00:02,  1.37it/s]
 98%|█████████▊| 98/100 [01:24<00:01,  1.15it/s]
 99%|█████████▉| 99/100 [01:26<00:01,  1.22s/it]
100%|██████████| 100/100 [01:28<00:00,  1.34s/it]
100%|██████████| 100/100 [01:28<00:00,  1.14it/s]